# 赋值运算  算数运算的补充 += -= *= /= %= **= //=  共7个

# 定义四个变量
a, b, c, d = 23, 18, 10, 3

# a += b 等价于 a = a + b
# print('a += b:', a) # 41

# a -= b 等价于 a = a - b
# print('a -= b:', a) # 5

# a *= b 等价于 a = a * b
# print('a *= b:', a) # 414

# a /= b 等价于 a = a / b
# print('a /= b:', a) # 1.2777777777777777

# a %= b 等价于 a = a % b
# print('a %= b:', a) # 5

# a **= b 等价于 a = a ** b
# print('a **= b:', a) # 3244150909895248285300369

a //= b #等价于 a = a // b
print('a //= b:', a) # 1